$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'Compiler' => 'GNU C++17 11.2.1 20220127 (Red Hat 11.2.1-9) -mcx16 -mtune=generic -march=x86-64 -g -Og -std=c++17 -feliminate-unused-debug-symbols -fno-strict-aliasing -fPIC',
          'Headers' => {
                         'BufferWriter.h' => 1,
                         'RBTree.h' => 1,
                         'Scalar.h' => 1,
                         'TextView.h' => 1,
                         'bwf_base.h' => 1,
                         'bwf_ex.h' => 1,
                         'bwf_ip.h' => 1,
                         'bwf_std.h' => 1,
                         'swoc_file.h' => 1,
                         'swoc_ip.h' => 1,
                         'ts.h' => 1
                       },
          'Language' => 'C++',
          'LibraryName' => 'libtscore.so.10.0.0',
          'LibraryVersion' => 'current',
          'NameSpaces' => {
                            'YAML' => 1,
                            'YAML::ErrorMsg' => 1,
                            'YAML::Exp' => 1,
                            'YAML::Keys' => 1,
                            'YAML::Utils' => 1,
                            'YAML::detail' => 1,
                            '__gnu_cxx' => 1,
                            '__gnu_cxx::__ops' => 1,
                            '__pstl::execution::v1' => 1,
                            'ats' => 1,

                                                    'ink_atomiclist_popall' => 1,
                                                    'ink_atomiclist_push' => 1,
                                                    'ink_atomiclist_remove' => 1,
                                                    'ink_backtrace' => 1,
                                                    'ink_freelist_create' => 1,
                                                    'ink_freelist_free' => 1,
                                                    'ink_freelist_free_bulk' => 1,
                                                    'ink_freelist_freelist_ops' => 1,
                                                    'ink_freelist_init' => 1,
                                                    'ink_freelist_init_ops' => 1,
                                                    'ink_freelist_madvise_init' => 1,
                                                    'ink_freelist_malloc_ops' => 1,
                                                    'ink_freelist_new' => 1,
                                                    'ink_freelists_dump' => 1,
                                                    'ink_freelists_dump_baselinerel' => 1,
                                                    'ink_freelists_snap_baseline' => 1,
                                                    'ink_mutex_initializer' => -40,
                                                    'ink_queue_load_64' => 1,
                                                    'ink_stack_trace_dump' => 1,
                                                    'ip_allow_dest_tags' => -56,
                                                    'ip_allow_src_tags' => -56,
                                                    'local_flags' => 1,
                                                    'matcher_type_str' => -56,
                                                    'n_file_arguments' => -4,
                                                    'ns_name_ntop' => 1,
                                                    'off' => -4,
                                                    'on' => -4,
                                                    'parseRulesCType' => -1024,
                                                    'parseRulesCTypeToLower' => -256,
                                                    'parseRulesCTypeToUpper' => -256,
                                                    'program_name' => -8,
                                                    'regressionTest_Regression' => -64,
                                                    'res_track_memory' => -4,
                                                    'socks_server_tags' => -56,
                                                    'ssl_memory_allocated' => -8,
                                                    'ssl_memory_freed' => -8,
                                                    'usage_return_code' => -4
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1002611' => {
                                         'Header' => undef,
                                         'Line' => '47',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '0',
                                                              'type' => '1007306'
                                                            }
                                                   },
                                         'Name' => 'struct __gnu_cxx::__aligned_membuf<std::pair<unsigned long const, ATSConsistentHashNode*> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '982871'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1005796' => {
                                         'Header' => undef,
                                         'Line' => '34',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'available',
                                                              'offset' => '0',
                                                              'type' => '964612'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '9255'
                                                            }
                                                   },
                                         'Name' => 'struct ATSConsistentHashNode',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1005918' => {
                                         'BaseType' => '983752',
                                         'Name' => 'struct std::_Rb_tree_node<std::pair<unsigned long const, ATSConsistentHashNode*> >*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1006143' => {
                                         'BaseType' => '1005796',
                                         'Name' => 'struct ATSConsistentHashNode*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1007306' => {
                                         'BaseType' => '7970',
                                         'Name' => 'unsigned char[16]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1037430' => {
                                         'BaseType' => '1005796',
                                         'Name' => 'struct ATSConsistentHashNode&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '1066725' => {
                                         'BaseType' => '9320',
                                         'Name' => 'uint8_t[16]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1066741' => {
                                         'BaseType' => '9344',
                                         'Name' => 'uint32_t[4]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1074926' => {
                                         'Header' => undef,
                                         'Line' => '40',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'b',
                                                              'offset' => '0',
                                                              'type' => '1075980'
                                                            },
                                                     '1' => {
                                                              'name' => 'u64',
                                                              'offset' => '0',
                                                              'type' => '1075980'
                                                            },
                                                     '2' => {
                                                              'name' => 'u32',
                                                              'offset' => '0',
                                                              'type' => '1066741'
                                                            },
                                                     '3' => {
                                                              'name' => 'u8',
                                                              'offset' => '0',
                                                              'type' => '1066725'
                                                            }
                                                   },
                                         'Name' => 'union ats::CryptoHash',
                                         'NameSpace' => 'ats',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Union'
                                       },
                          '1075313' => {
                                         'BaseType' => '1074926',
                                         'Name' => 'union ats::CryptoHash const',
                                         'Size' => '16',
                                         'Type' => 'Const'
                                       },
                          '1075980' => {
                                         'BaseType' => '9356',
                                         'Name' => 'uint64_t[2]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1076006' => {
                                         'BaseType' => '1075313',
                                         'Name' => 'union ats::CryptoHash const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '1080114' => {
                                         'BaseType' => '7958',
                                         'Header' => undef,
                                         'Line' => '145',
                                         'Name' => '__dev_t',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1080126' => {
                                         'BaseType' => '7984',
                                         'Header' => undef,
                                         'Line' => '146',
                                         'Name' => '__uid_t',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1080138' => {
                                         'BaseType' => '7984',
                                         'Header' => undef,
                                         'Line' => '147',
                                         'Name' => '__gid_t',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1080150' => {
                                         'BaseType' => '7958',
                                         'Header' => undef,
                                         'Line' => '148',
                                         'Name' => '__ino_t',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1080162' => {
                                         'BaseType' => '7984',
                                         'Header' => undef,
                                         'Line' => '150',
                                         'Name' => '__mode_t',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1080174' => {
                                         'BaseType' => '7958',
                                         'Header' => undef,
                                         'Line' => '151',
                                         'Name' => '__nlink_t',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1080253' => {
                                         'BaseType' => '8024',
                                         'Header' => undef,
                                         'Line' => '175',
                                         'Name' => '__blksize_t',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1080265' => {
                                         'BaseType' => '8024',
                                         'Header' => undef,
                                         'Line' => '180',
                                         'Name' => '__blkcnt_t',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1120133' => {
                                         'BaseType' => '7970',
                                         'Name' => 'unsigned char[8]',
                                         'Size' => '8',
                                         'Type' => 'Array'
                                       },
                          '1127111' => {
                                         'Header' => undef,
                                         'Line' => '26',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'st_dev',
                                                              'offset' => '0',
                                                              'type' => '1080114'
                                                            },
                                                     '1' => {
                                                              'name' => 'st_ino',
                                                              'offset' => '8',
                                                              'type' => '1080150'
                                                            },
                                                     '10' => {
                                                               'name' => 'st_blocks',
                                                               'offset' => '100',
                                                               'type' => '1080265'
                                                             },
                                                     '11' => {
                                                               'name' => 'st_atim',
                                                               'offset' => '114',
                                                               'type' => '9830'
                                                             },
                                                     '12' => {
                                                               'name' => 'st_mtim',
                                                               'offset' => '136',
                                                               'type' => '9830'
                                                             },
                                                     '13' => {
                                                               'name' => 'st_ctim',
                                                               'offset' => '260',
                                                               'type' => '9830'
                                                             },
                                                     '14' => {
                                                               'name' => '__glibc_reserved',
                                                               'offset' => '288',
                                                               'type' => '1127320'
                                                             },
                                                     '2' => {
                                                              'name' => 'st_nlink',
                                                              'offset' => '22',
                                                              'type' => '1080174'
                                                            },
                                                     '3' => {
                                                              'name' => 'st_mode',
                                                              'offset' => '36',
                                                              'type' => '1080162'
                                                            },
                                                     '4' => {
                                                              'name' => 'st_uid',
                                                              'offset' => '40',
                                                              'type' => '1080126'
                                                            },
                                                     '5' => {
                                                              'name' => 'st_gid',
                                                              'offset' => '50',
                                                              'type' => '1080138'
                                                            },
                                                     '6' => {
                                                              'name' => '__pad0',
                                                              'offset' => '54',
                                                              'type' => '8012'
                                                            },
                                                     '7' => {
                                                              'name' => 'st_rdev',
                                                              'offset' => '64',
                                                              'type' => '1080114'
                                                            },
                                                     '8' => {
                                                              'name' => 'st_size',
                                                              'offset' => '72',
                                                              'type' => '9192'
                                                            },
                                                     '9' => {
                                                              'name' => 'st_blksize',
                                                              'offset' => '86',
                                                              'type' => '1080253'
                                                            }
                                                   },
                                         'Name' => 'struct stat',
                                         'PrivateABI' => 1,
                                         'Size' => '144',
                                         'Type' => 'Struct'
                                       },
                          '1127320' => {
                                         'BaseType' => '9243',
                                         'Name' => '__syscall_slong_t[3]',
                                         'Size' => '24',
                                         'Type' => 'Array'
                                       },
                          '1127377' => {
                                         'BaseType' => '7977',
                                         'Header' => undef,
                                         'Line' => '28',
                                         'Name' => 'sa_family_t',
                                         'PrivateABI' => 1,
                                         'Size' => '2',
                                         'Type' => 'Typedef'
                                       },
                          '1127389' => {
                                         'Header' => undef,
                                         'Line' => '178',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'sa_family',
                                                              'offset' => '0',
                                                              'type' => '1127377'
                                                            },
                                                     '1' => {
                                                              'name' => 'sa_data',
                                                              'offset' => '2',
                                                              'type' => '1127434'
                                                            }
                                                   },
                                         'Name' => 'struct sockaddr',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1127429' => {
                                         'BaseType' => '1127389',
                                         'Name' => 'struct sockaddr const',
                                         'Size' => '16',
                                         'Type' => 'Const'
                                       },
                          '1127434' => {
                                         'BaseType' => '9260',
                                         'Name' => 'char[14]',
                                         'Size' => '14',
                                         'Type' => 'Array'
                                       },
                          '1127698' => {
                                         'BaseType' => '9344',
                                         'Header' => undef,
                                         'Line' => '30',
                                         'Name' => 'in_addr_t',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1127749' => {
                                         'Header' => undef,
                                         'Line' => '216',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '__in6_u',
                                                              'offset' => '0',
                                                              'type' => '1127762'
                                                            }
                                                   },
                                         'Name' => 'struct in6_addr',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1127762' => {
                                         'Header' => undef,
                                         'Line' => '219',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '__u6_addr8',
                                                              'offset' => '0',
                                                              'type' => '1066725'
                                                            },
                                                     '1' => {
                                                              'name' => '__u6_addr16',
                                                              'offset' => '0',
                                                              'type' => '1127844'
                                                            },
                                                     '2' => {
                                                              'name' => '__u6_addr32',
                                                              'offset' => '0',
                                                              'type' => '1066741'
                                                            }
                                                   },
                                         'NameSpace' => 'in6_addr',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Union'
                                       },
                          '1127823' => {
                                         'BaseType' => '1127749',
                                         'Name' => 'struct in6_addr const',
                                         'Size' => '16',
                                         'Type' => 'Const'
                                       },
                          '1127844' => {
                                         'BaseType' => '9332',
                                         'Name' => 'uint16_t[8]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1132616' => {
                                         'BaseType' => '1127429',
                                         'Name' => 'struct sockaddr const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1132621' => {
                                         'BaseType' => '1133851',
                                         'Name' => 'struct IpAddr const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '1132626' => {
                                         'Header' => undef,
                                         'Line' => '1166',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_family',
                                                              'offset' => '0',
                                                              'type' => '9332'
                                                            },
                                                     '1' => {
                                                              'name' => '_addr',
                                                              'offset' => '8',
                                                              'type' => '1132658'
                                                            }
                                                   },
                                         'Name' => 'struct IpAddr',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1132658' => {
                                         'Header' => undef,
                                         'Line' => '1318',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_ip4',
                                                              'offset' => '0',
                                                              'type' => '1127698'
                                                            },
                                                     '1' => {
                                                              'name' => '_ip6',
                                                              'offset' => '0',
                                                              'type' => '1127749'
                                                            },
                                                     '2' => {
                                                              'name' => '_byte',
                                                              'offset' => '0',
                                                              'type' => '1066725'
                                                            },
                                                     '3' => {
                                                              'name' => '_u32',
                                                              'offset' => '0',
                                                              'type' => '1066741'
                                                            },
                                                     '4' => {
                                                              'name' => '_u64',
                                                              'offset' => '0',
                                                              'type' => '1075980'
                                                            }
                                                   },
                                         'Name' => 'union IpAddr::Addr',
                                         'NameSpace' => 'IpAddr',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Union'
                                       },
                          '1133851' => {
                                         'BaseType' => '1132626',
                                         'Name' => 'struct IpAddr const',
                                         'Size' => '24',
                                         'Type' => 'Const'
                                       },
                          '1133954' => {
                                         'BaseType' => '1127823',
                                         'Name' => 'struct in6_addr const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '1187876' => {
                                         'Base' => {
                                                     '1193896' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '766',
                                         'Name' => 'std::deque<ts::Errata::Message>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '80',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '1225143'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '119034' => {
                                        'BaseType' => '9255',
                                        'Name' => 'char*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '1191548' => {
                                         'Base' => {
                                                     '1214426' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<ts::Errata::Message>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '1225143'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1192417' => {
                                         'Header' => undef,
                                         'Line' => '113',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_cur',
                                                              'offset' => '0',
                                                              'type' => '1192446'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_first',
                                                              'offset' => '8',
                                                              'type' => '1192446'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_last',
                                                              'offset' => '22',
                                                              'type' => '1192446'
                                                            },
                                                     '3' => {
                                                              'name' => '_M_node',
                                                              'offset' => '36',
                                                              'type' => '1192497'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Deque_iterator<ts::Errata::Message, ts::Errata::Message&, ts::Errata::Message*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '32',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '1225143'
                                                              },
                                                       '1' => {
                                                                'key' => '_Ref',
                                                                'type' => '1231184'
                                                              },
                                                       '2' => {
                                                                'key' => '_Ptr',
                                                                'type' => '1231113'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1192446' => {
                                         'BaseType' => '993949',
                                         'Header' => undef,
                                         'Line' => '127',
                                         'Name' => 'std::_Deque_iterator<ts::Errata::Message, ts::Errata::Message&, ts::Errata::Message*>::_Elt_pointer',
                                         'NameSpace' => 'std::_Deque_iterator<ts::Errata::Message, ts::Errata::Message&, ts::Errata::Message*>',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1192497' => {
                                         'BaseType' => '993949',
                                         'Header' => undef,
                                         'Line' => '128',
                                         'Name' => 'std::_Deque_iterator<ts::Errata::Message, ts::Errata::Message&, ts::Errata::Message*>::_Map_pointer',
                                         'NameSpace' => 'std::_Deque_iterator<ts::Errata::Message, ts::Errata::Message&, ts::Errata::Message*>',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1193896' => {
                                         'Header' => undef,
                                         'Line' => '408',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '1194185'
                                                            }
                                                   },
                                         'Name' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '80',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '1225143'
                                                              },
                                                       '1' => {
                                                                'key' => '_Alloc',
                                                                'type' => '1191548'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1193927' => {
                                         'Header' => undef,
                                         'Line' => '487',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_map',
                                                              'offset' => '0',
                                                              'type' => '1194157'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_map_size',
                                                              'offset' => '8',
                                                              'type' => '287'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_start',
                                                              'offset' => '22',
                                                              'type' => '1194171'
                                                            },
                                                     '3' => {
                                                              'name' => '_M_finish',
                                                              'offset' => '72',
                                                              'type' => '1194171'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >::_Deque_impl_data',
                                         'NameSpace' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '80',
                                         'Type' => 'Struct'
                                       },
                          '1194157' => {
                                         'BaseType' => '1192497',
                                         'Header' => undef,
                                         'Line' => '485',
                                         'Name' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >::_Map_pointer',
                                         'NameSpace' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1194171' => {
                                         'BaseType' => '1192417',
                                         'Header' => undef,
                                         'Line' => '433',
                                         'Name' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >::iterator',
                                         'NameSpace' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1194185' => {
                                         'Base' => {
                                                     '1191548' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '1193927' => {
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '520',
                                         'Name' => 'struct std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >::_Deque_impl',
                                         'NameSpace' => 'std::_Deque_base<ts::Errata::Message, std::allocator<ts::Errata::Message> >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '80',
                                         'Type' => 'Struct'
                                       },
                          '120856' => {
                                        'Header' => undef,
                                        'Line' => '55',
                                        'Name' => '__gnu_cxx::new_allocator<char>',
                                        'NameSpace' => '__gnu_cxx',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'TParam' => {
                                                      '0' => {
                                                               'key' => '_Tp',
                                                               'type' => '9260'
                                                             }
                                                    },
                                        'Type' => 'Class'
                                      },
                          '121339' => {
                                        'Base' => {
                                                    '41723' => {
                                                                 'pos' => '0'
                                                               }
                                                  },
                                        'Copied' => 1,
                                        'Header' => undef,
                                        'Line' => '48',
                                        'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<char> >',
                                        'NameSpace' => '__gnu_cxx',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'TParam' => {
                                                      '0' => {
                                                               'key' => '_Alloc',
                                                               'type' => '38705'
                                                             }
                                                    },
                                        'Type' => 'Struct'
                                      },
                          '1214426' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<ts::Errata::Message>',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '1225143'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '121530' => {
                                        'BaseType' => '41737',
                                        'Header' => undef,
                                        'Line' => '57',
                                        'Name' => '__gnu_cxx::__alloc_traits<std::allocator<char> >::pointer',
                                        'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<char> >',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '121554' => {
                                        'BaseType' => '41800',
                                        'Header' => undef,
                                        'Line' => '59',
                                        'Name' => '__gnu_cxx::__alloc_traits<std::allocator<char> >::size_type',
                                        'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<char> >',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '1223791' => {
                                         'Header' => undef,
                                         'Line' => '62',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => 'm_intrusive_pointer_reference_count',
                                                              'offset' => '0',
                                                              'type' => '1223959'
                                                            }
                                                   },
                                         'Name' => 'ts::IntrusivePtrCounter',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Class'
                                       },
                          '1223959' => {
                                         'BaseType' => '8024',
                                         'Header' => undef,
                                         'Line' => '91',
                                         'Name' => 'ts::IntrusivePtrCounter::intrusive_ptr_reference_counter_type',
                                         'NameSpace' => 'ts::IntrusivePtrCounter',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1224009' => {
                                         'Header' => undef,
                                         'Line' => '145',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_obj',
                                                              'offset' => '0',
                                                              'type' => '1230841'
                                                            }
                                                   },
                                         'Name' => 'ts::IntrusivePtr<ts::Errata::Data>',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => 'T',
                                                                'type' => '1224636'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1224623' => {
                                         'Header' => undef,
                                         'Line' => '82',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => 'm_data',
                                                              'offset' => '0',
                                                              'type' => '1227721'
                                                            }
                                                   },
                                         'Name' => 'ts::Errata',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Class'
                                       },
                          '1224636' => {
                                         'Base' => {
                                                     '1223791' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '487',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'm_log_on_delete',
                                                              'offset' => '8',
                                                              'type' => '7936'
                                                            },
                                                     '1' => {
                                                              'name' => 'm_items',
                                                              'offset' => '22',
                                                              'type' => '1227835'
                                                            }
                                                   },
                                         'Name' => 'struct ts::Errata::Data',
                                         'NameSpace' => 'ts::Errata',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '96',
                                         'Type' => 'Struct'
                                       },
                          '1225043' => {
                                         'BaseType' => '1227854',
                                         'Header' => undef,
                                         'Line' => '94',
                                         'Name' => 'ts::Errata::Id',
                                         'NameSpace' => 'ts::Errata',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1225098' => {
                                         'BaseType' => '1228668',
                                         'Header' => undef,
                                         'Line' => '102',
                                         'Name' => 'ts::Errata::Code',
                                         'NameSpace' => 'ts::Errata',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1225143' => {
                                         'Header' => undef,
                                         'Line' => '373',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'm_id',
                                                              'offset' => '0',
                                                              'type' => '1225043'
                                                            },
                                                     '1' => {
                                                              'name' => 'm_code',
                                                              'offset' => '4',
                                                              'type' => '1225098'
                                                            },
                                                     '2' => {
                                                              'name' => 'm_text',
                                                              'offset' => '8',
                                                              'type' => '50358'
                                                            },
                                                     '3' => {
                                                              'name' => 'm_errata',
                                                              'offset' => '64',
                                                              'type' => '1224623'
                                                            }
                                                   },
                                         'Name' => 'struct ts::Errata::Message',
                                         'NameSpace' => 'ts::Errata',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1227721' => {
                                         'BaseType' => '1224009',
                                         'Header' => undef,
                                         'Line' => '88',
                                         'Name' => 'ts::Errata::ImpPtr',
                                         'NameSpace' => 'ts::Errata',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1227835' => {
                                         'BaseType' => '1187876',
                                         'Header' => undef,
                                         'Line' => '105',
                                         'Name' => 'ts::Errata::Container',
                                         'NameSpace' => 'ts::Errata',
                                         'PrivateABI' => 1,
                                         'Size' => '80',
                                         'Type' => 'Typedef'
                                       },
                          '1227849' => {
                                         'BaseType' => '1224623',
                                         'Name' => 'ts::Errata const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1227854' => {
                                         'Base' => {
                                                     '1230096' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '97',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_t',
                                                              'offset' => '0',
                                                              'type' => '1227981'
                                                            }
                                                   },
                                         'Name' => 'ts::NumericType<unsigned int, ts::MsgIdTag>',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => 'T',
                                                                'type' => '7984'
                                                              },
                                                       '1' => {
                                                                'key' => 'X',
                                                                'type' => '1230795'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '122793' => {
                                        'Header' => undef,
                                        'Line' => '55',
                                        'Name' => '__gnu_cxx::new_allocator<std::__cxx11::basic_string<char> >',
                                        'NameSpace' => '__gnu_cxx',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'TParam' => {
                                                      '0' => {
                                                               'key' => '_Tp',
                                                               'type' => '42017'
                                                             }
                                                    },
                                        'Type' => 'Class'
                                      },
                          '1227981' => {
                                         'BaseType' => '7984',
                                         'Header' => undef,
                                         'Line' => '100',
                                         'Name' => 'ts::NumericType<unsigned int, ts::MsgIdTag>::raw_type',
                                         'NameSpace' => 'ts::NumericType<unsigned int, ts::MsgIdTag>',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1228668' => {
                                         'Base' => {
                                                     '1230345' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '97',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_t',
                                                              'offset' => '0',
                                                              'type' => '1228795'
                                                            }
                                                   },
                                         'Name' => 'ts::NumericType<unsigned int, ts::CodeTag>',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => 'T',
                                                                'type' => '7984'
                                                              },
                                                       '1' => {
                                                                'key' => 'X',
                                                                'type' => '1230800'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1228795' => {
                                         'BaseType' => '7984',
                                         'Header' => undef,
                                         'Line' => '100',
                                         'Name' => 'ts::NumericType<unsigned int, ts::CodeTag>::raw_type',
                                         'NameSpace' => 'ts::NumericType<unsigned int, ts::CodeTag>',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1230096' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '70',
                                         'Name' => 'ts::NumericTypeIntOperators<unsigned int, ts::MsgIdTag>',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => 'T',
                                                                'type' => '7984'
                                                              },
                                                       '1' => {
                                                                'key' => 'X',
                                                                'type' => '1230795'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1230345' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '70',
                                         'Name' => 'ts::NumericTypeIntOperators<unsigned int, ts::CodeTag>',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => 'T',
                                                                'type' => '7984'
                                                              },
                                                       '1' => {
                                                                'key' => 'X',
                                                                'type' => '1230800'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1230795' => {
                                         'Name' => 'struct ts::MsgIdTag',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1230800' => {
                                         'Name' => 'struct ts::CodeTag',
                                         'NameSpace' => 'ts',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1230841' => {
                                         'BaseType' => '1224636',
                                         'Name' => 'struct ts::Errata::Data*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1230948' => {
                                         'BaseType' => '1227849',
                                         'Name' => 'ts::Errata const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '1231113' => {
                                         'BaseType' => '1225143',
                                         'Name' => 'struct ts::Errata::Message*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1231184' => {
                                         'BaseType' => '1225143',
                                         'Name' => 'struct ts::Errata::Message&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '123351' => {
                                        'Base' => {
                                                    '55686' => {
                                                                 'pos' => '0'
                                                               }
                                                  },
                                        'Copied' => 1,
                                        'Header' => undef,
                                        'Line' => '48',
                                        'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > >',
                                        'NameSpace' => '__gnu_cxx',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'TParam' => {
                                                      '0' => {
                                                               'key' => '_Alloc',
                                                               'type' => '55540'
                                                             }
                                                    },
                                        'Type' => 'Struct'
                                      },
                          '123542' => {
                                        'BaseType' => '55700',
                                        'Header' => undef,
                                        'Line' => '57',
                                        'Name' => '__gnu_cxx::__alloc_traits<std::allocator<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > >::pointer',
                                        'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > >',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134018' => {
                                        'BaseType' => '8012',
                                        'Header' => undef,
                                        'Line' => '32',
                                        'Name' => '_Atomic_word',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '135944' => {
                                        'BaseType' => '9260',
                                        'Name' => 'char[16]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '135960' => {
                                        'BaseType' => '42017',
                                        'Name' => 'std::__cxx11::basic_string<char>*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136031' => {
                                        'BaseType' => '50370',
                                        'Name' => 'std::string const&',
                                        'Size' => '8',
                                        'Type' => 'Ref'
                                      },
                          '136289' => {
                                        'BaseType' => '53608',
                                        'Name' => 'struct std::_Rb_tree_node_base*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '140760' => {
                                        'BaseType' => '53523',
                                        'Name' => 'std::ostream&',
                                        'Size' => '8',
                                        'Type' => 'Ref'
                                      },
                          '2846640' => {
                                         'Header' => undef,
                                         'Line' => '349',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '2846653'
                                                            }
                                                   },
                                         'Name' => 'std::__cxx11::_List_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'NameSpace' => 'std::__cxx11',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              },
                                                       '1' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2880351'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2846653' => {
                                         'Base' => {
                                                     '2885764' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '374',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_node',
                                                              'offset' => '0',
                                                              'type' => '2852045'
                                                            }
                                                   },
                                         'Name' => 'struct std::__cxx11::_List_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >::_List_impl',
                                         'NameSpace' => 'std::__cxx11::_List_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '2847593' => {
                                         'Base' => {
                                                     '2846640' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '556',
                                         'Name' => 'std::__cxx11::list<std::pair<YAML::detail::node*, YAML::detail::node*> >',
                                         'NameSpace' => 'std::__cxx11',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2851858' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '80',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_next',
                                                              'offset' => '0',
                                                              'type' => '2938623'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_prev',
                                                              'offset' => '8',
                                                              'type' => '2938623'
                                                            }
                                                   },
                                         'Name' => 'struct std::__detail::_List_node_base',
                                         'NameSpace' => 'std::__detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '2852045' => {
                                         'Base' => {
                                                     '2851858' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '103',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_size',
                                                              'offset' => '22',
                                                              'type' => '287'
                                                            }
                                                   },
                                         'Name' => 'struct std::__detail::_List_node_header',
                                         'NameSpace' => 'std::__detail',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '2862838' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '103',
                                         'Name' => 'std::_Mutex_base<2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2864764' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '971',
                                         'Name' => 'std::__shared_ptr_access<YAML::detail::memory_holder, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2932226'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2864911' => {
                                         'Header' => undef,
                                         'Line' => '1987',
                                         'Name' => 'struct std::remove_extent<YAML::detail::memory_holder>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2932226'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2864925' => {
                                         'BaseType' => '2932226',
                                         'Header' => undef,
                                         'Line' => '1988',
                                         'Name' => 'std::remove_extent<YAML::detail::memory_holder>::type',
                                         'NameSpace' => 'std::remove_extent<YAML::detail::memory_holder>',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2864948' => {
                                         'Header' => undef,
                                         'Line' => '578',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_pi',
                                                              'offset' => '0',
                                                              'type' => '2939033'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_count<2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2865853' => {
                                         'Base' => {
                                                     '2862838' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '122',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_vptr',
                                                              'offset' => '0',
                                                              'type' => '856771'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_use_count',
                                                              'offset' => '8',
                                                              'type' => '134018'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => '_M_weak_count',
                                                              'offset' => '18',
                                                              'type' => '134018'
                                                            }
                                                   },
                                         'Name' => 'std::_Sp_counted_base<2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2866364' => {
                                         'Base' => {
                                                     '2864764' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '1052',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '2939068'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '8',
                                                              'type' => '2864948'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<YAML::detail::memory_holder, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2932226'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2866644' => {
                                         'BaseType' => '2864925',
                                         'Header' => undef,
                                         'Line' => '1056',
                                         'Name' => 'std::__shared_ptr<YAML::detail::memory_holder, 2>::element_type',
                                         'NameSpace' => 'std::__shared_ptr<YAML::detail::memory_holder, 2>',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2866950' => {
                                         'Base' => {
                                                     '2866364' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '122',
                                         'Name' => 'std::shared_ptr<YAML::detail::memory_holder>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2932226'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2867257' => {
                                         'Base' => {
                                                     '2904699' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '122',
                                         'Name' => 'std::shared_ptr<YAML::detail::node>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2933112'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2867525' => {
                                         'Base' => {
                                                     '2916299' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2867913' => {
                                         'Base' => {
                                                     '2916923' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<std::_Rb_tree_node<std::shared_ptr<YAML::detail::node> > >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2868060'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2868060' => {
                                         'Base' => {
                                                     '53608' => {
                                                                  'pos' => '0'
                                                                }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '216',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '50',
                                                              'type' => '2923481'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Rb_tree_node<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Val',
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2868166' => {
                                         'Header' => undef,
                                         'Line' => '131',
                                         'Name' => 'struct std::binary_function<std::shared_ptr<YAML::detail::node>, std::shared_ptr<YAML::detail::node>, bool>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Arg1',
                                                                'type' => '2867257'
                                                              },
                                                       '1' => {
                                                                'key' => '_Arg2',
                                                                'type' => '2867257'
                                                              },
                                                       '2' => {
                                                                'key' => '_Result',
                                                                'type' => '7936'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2868207' => {
                                         'Base' => {
                                                     '2868166' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '395',
                                         'Name' => 'struct std::less<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2868283' => {
                                         'Header' => undef,
                                         'Line' => '142',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_key_compare',
                                                              'offset' => '0',
                                                              'type' => '2868207'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Rb_tree_key_compare<std::less<std::shared_ptr<YAML::detail::node> > >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key_compare',
                                                                'type' => '2868207'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2868443' => {
                                         'Header' => undef,
                                         'Line' => '425',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '2868456'
                                                            }
                                                   },
                                         'Name' => 'std::_Rb_tree<std::shared_ptr<YAML::detail::node>, std::shared_ptr<YAML::detail::node>, std::_Identity<std::shared_ptr<YAML::detail::node> >, std::less<std::shared_ptr<YAML::detail::node> >, std::allocator<std::shared_ptr<YAML::detail::node> > >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key',
                                                                'type' => '2867257'
                                                              },
                                                       '1' => {
                                                                'key' => '_Val',
                                                                'type' => '2867257'
                                                              },
                                                       '2' => {
                                                                'key' => '_KeyOfValue',
                                                                'type' => '2910523'
                                                              },
                                                       '3' => {
                                                                'key' => '_Compare',
                                                                'type' => '2868207'
                                                              },
                                                       '4' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2867525'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2868456' => {
                                         'Base' => {
                                                     '2867913' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '2868283' => {
                                                                    'pos' => '1'
                                                                  },
                                                     '53803' => {
                                                                  'pos' => '2'
                                                                }
                                                   },
                                         'Header' => undef,
                                         'Line' => '660',
                                         'Name' => 'struct std::_Rb_tree<std::shared_ptr<YAML::detail::node>, std::shared_ptr<YAML::detail::node>, std::_Identity<std::shared_ptr<YAML::detail::node> >, std::less<std::shared_ptr<YAML::detail::node> >, std::allocator<std::shared_ptr<YAML::detail::node> > >::_Rb_tree_impl<std::less<std::shared_ptr<YAML::detail::node> > >',
                                         'NameSpace' => 'std::_Rb_tree<std::shared_ptr<YAML::detail::node>, std::shared_ptr<YAML::detail::node>, std::_Identity<std::shared_ptr<YAML::detail::node> >, std::less<std::shared_ptr<YAML::detail::node> >, std::allocator<std::shared_ptr<YAML::detail::node> > >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key_compare',
                                                                'type' => '2868207'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '287' => {
                                     'BaseType' => '7958',
                                     'Header' => undef,
                                     'Line' => '2426',
                                     'Name' => 'std::size_t',
                                     'NameSpace' => 'std',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2872285' => {
                                         'Header' => undef,
                                         'Line' => '94',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_t',
                                                              'offset' => '0',
                                                              'type' => '2872298'
                                                            }
                                                   },
                                         'Name' => 'std::set<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key',
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2872298' => {
                                         'BaseType' => '2868443',
                                         'Header' => undef,
                                         'Line' => '132',
                                         'Name' => 'std::set<std::shared_ptr<YAML::detail::node> >::_Rep_type',
                                         'NameSpace' => 'std::set<std::shared_ptr<YAML::detail::node> >',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2874264' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '971',
                                         'Name' => 'std::__shared_ptr_access<YAML::detail::memory, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2934302'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2874411' => {
                                         'Header' => undef,
                                         'Line' => '1987',
                                         'Name' => 'struct std::remove_extent<YAML::detail::memory>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2934302'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2874425' => {
                                         'BaseType' => '2934302',
                                         'Header' => undef,
                                         'Line' => '1988',
                                         'Name' => 'std::remove_extent<YAML::detail::memory>::type',
                                         'NameSpace' => 'std::remove_extent<YAML::detail::memory>',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2874448' => {
                                         'Base' => {
                                                     '2874264' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '1052',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '2939468'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '8',
                                                              'type' => '2864948'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<YAML::detail::memory, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2934302'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2874728' => {
                                         'BaseType' => '2874425',
                                         'Header' => undef,
                                         'Line' => '1056',
                                         'Name' => 'std::__shared_ptr<YAML::detail::memory, 2>::element_type',
                                         'NameSpace' => 'std::__shared_ptr<YAML::detail::memory, 2>',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2875034' => {
                                         'Base' => {
                                                     '2874448' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '122',
                                         'Name' => 'std::shared_ptr<YAML::detail::memory>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2934302'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2875312' => {
                                         'Base' => {
                                                     '2917318' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2875459' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '411',
                                         'Name' => 'struct std::allocator_traits<std::allocator<YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2875312'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2875473' => {
                                         'BaseType' => '2939528',
                                         'Header' => undef,
                                         'Line' => '420',
                                         'Name' => 'std::allocator_traits<std::allocator<YAML::detail::node*> >::pointer',
                                         'NameSpace' => 'std::allocator_traits<std::allocator<YAML::detail::node*> >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '2875726' => {
                                         'Header' => undef,
                                         'Line' => '84',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '2875924'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2939153'
                                                              },
                                                       '1' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2875312'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2875739' => {
                                         'Header' => undef,
                                         'Line' => '91',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_start',
                                                              'offset' => '0',
                                                              'type' => '2875912'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_finish',
                                                              'offset' => '8',
                                                              'type' => '2875912'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_end_of_storage',
                                                              'offset' => '22',
                                                              'type' => '2875912'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >::_Vector_impl_data',
                                         'NameSpace' => 'std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '2875912' => {
                                         'BaseType' => '2917914',
                                         'Header' => undef,
                                         'Line' => '89',
                                         'Name' => 'std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >::pointer',
                                         'NameSpace' => 'std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '2875924' => {
                                         'Base' => {
                                                     '2875312' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '2875739' => {
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '128',
                                         'Name' => 'struct std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >::_Vector_impl',
                                         'NameSpace' => 'std::_Vector_base<YAML::detail::node*, std::allocator<YAML::detail::node*> >',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '2876671' => {
                                         'Base' => {
                                                     '2875726' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '389',
                                         'Name' => 'std::vector<YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2880015' => {
                                         'Base' => {
                                                     '2884912' => {
                                                                    'access' => 'private',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '211',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'first',
                                                              'offset' => '0',
                                                              'type' => '2939153'
                                                            },
                                                     '1' => {
                                                              'name' => 'second',
                                                              'offset' => '8',
                                                              'type' => '2939153'
                                                            }
                                                   },
                                         'Name' => 'struct std::pair<YAML::detail::node*, YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_T1',
                                                                'type' => '2939153'
                                                              },
                                                       '1' => {
                                                                'key' => '_T2',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2880351' => {
                                         'Base' => {
                                                     '2919172' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2880015'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2880498' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '411',
                                         'Name' => 'struct std::allocator_traits<std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2880351'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2880512' => {
                                         'BaseType' => '2939723',
                                         'Header' => undef,
                                         'Line' => '420',
                                         'Name' => 'std::allocator_traits<std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >::pointer',
                                         'NameSpace' => 'std::allocator_traits<std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '2880765' => {
                                         'Header' => undef,
                                         'Line' => '84',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '2880963'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              },
                                                       '1' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2880351'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2880778' => {
                                         'Header' => undef,
                                         'Line' => '91',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_start',
                                                              'offset' => '0',
                                                              'type' => '2880951'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_finish',
                                                              'offset' => '8',
                                                              'type' => '2880951'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_end_of_storage',
                                                              'offset' => '22',
                                                              'type' => '2880951'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >::_Vector_impl_data',
                                         'NameSpace' => 'std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '2880951' => {
                                         'BaseType' => '2919768',
                                         'Header' => undef,
                                         'Line' => '89',
                                         'Name' => 'std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >::pointer',
                                         'NameSpace' => 'std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '2880963' => {
                                         'Base' => {
                                                     '2880351' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '2880778' => {
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '128',
                                         'Name' => 'struct std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >::_Vector_impl',
                                         'NameSpace' => 'std::_Vector_base<std::pair<YAML::detail::node*, YAML::detail::node*>, std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '2881710' => {
                                         'Base' => {
                                                     '2880765' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '389',
                                         'Name' => 'std::vector<std::pair<YAML::detail::node*, YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2884912' => {
                                         'Header' => undef,
                                         'Line' => '189',
                                         'Name' => 'std::__pair_base<YAML::detail::node*, YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_U1',
                                                                'type' => '2939153'
                                                              },
                                                       '1' => {
                                                                'key' => '_U2',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2885764' => {
                                         'Base' => {
                                                     '2921026' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<std::_List_node<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2885911'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2885911' => {
                                         'Base' => {
                                                     '2851858' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '166',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '22',
                                                              'type' => '2924093'
                                                            }
                                                   },
                                         'Name' => 'struct std::_List_node<std::pair<YAML::detail::node*, YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '32',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2887003' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '971',
                                         'Name' => 'std::__shared_ptr_access<YAML::detail::node_data, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2935243'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2887150' => {
                                         'Header' => undef,
                                         'Line' => '1987',
                                         'Name' => 'struct std::remove_extent<YAML::detail::node_data>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2935243'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2887164' => {
                                         'BaseType' => '2935243',
                                         'Header' => undef,
                                         'Line' => '1988',
                                         'Name' => 'std::remove_extent<YAML::detail::node_data>::type',
                                         'NameSpace' => 'std::remove_extent<YAML::detail::node_data>',
                                         'PrivateABI' => 1,
                                         'Size' => '176',
                                         'Type' => 'Typedef'
                                       },
                          '2887187' => {
                                         'Base' => {
                                                     '2887003' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '1052',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '2940313'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '8',
                                                              'type' => '2864948'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<YAML::detail::node_data, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2935243'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2887467' => {
                                         'BaseType' => '2887164',
                                         'Header' => undef,
                                         'Line' => '1056',
                                         'Name' => 'std::__shared_ptr<YAML::detail::node_data, 2>::element_type',
                                         'NameSpace' => 'std::__shared_ptr<YAML::detail::node_data, 2>',
                                         'PrivateABI' => 1,
                                         'Size' => '176',
                                         'Type' => 'Typedef'
                                       },
                          '2887773' => {
                                         'Base' => {
                                                     '2887187' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '122',
                                         'Name' => 'std::shared_ptr<YAML::detail::node_data>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2935243'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2888151' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '971',
                                         'Name' => 'std::__shared_ptr_access<YAML::detail::node_ref, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2936933'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2888298' => {
                                         'Header' => undef,
                                         'Line' => '1987',
                                         'Name' => 'struct std::remove_extent<YAML::detail::node_ref>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2936933'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2888312' => {
                                         'BaseType' => '2936933',
                                         'Header' => undef,
                                         'Line' => '1988',
                                         'Name' => 'std::remove_extent<YAML::detail::node_ref>::type',
                                         'NameSpace' => 'std::remove_extent<YAML::detail::node_ref>',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2888335' => {
                                         'Base' => {
                                                     '2888151' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '1052',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '2940498'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '8',
                                                              'type' => '2864948'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<YAML::detail::node_ref, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2936933'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2888615' => {
                                         'BaseType' => '2888312',
                                         'Header' => undef,
                                         'Line' => '1056',
                                         'Name' => 'std::__shared_ptr<YAML::detail::node_ref, 2>::element_type',
                                         'NameSpace' => 'std::__shared_ptr<YAML::detail::node_ref, 2>',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2888921' => {
                                         'Base' => {
                                                     '2888335' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '122',
                                         'Name' => 'std::shared_ptr<YAML::detail::node_ref>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2936933'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2889199' => {
                                         'Base' => {
                                                     '2921627' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '124',
                                         'Name' => 'std::allocator<std::_Rb_tree_node<YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2889378'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2889378' => {
                                         'Base' => {
                                                     '53608' => {
                                                                  'pos' => '0'
                                                                }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '216',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '50',
                                                              'type' => '2923238'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Rb_tree_node<YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Val',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2889484' => {
                                         'Header' => undef,
                                         'Line' => '142',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_key_compare',
                                                              'offset' => '0',
                                                              'type' => '2933125'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Rb_tree_key_compare<YAML::detail::node::less>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key_compare',
                                                                'type' => '2933125'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2889644' => {
                                         'Header' => undef,
                                         'Line' => '425',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '2889657'
                                                            }
                                                   },
                                         'Name' => 'std::_Rb_tree<YAML::detail::node*, YAML::detail::node*, std::_Identity<YAML::detail::node*>, YAML::detail::node::less, std::allocator<YAML::detail::node*> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key',
                                                                'type' => '2939153'
                                                              },
                                                       '1' => {
                                                                'key' => '_Val',
                                                                'type' => '2939153'
                                                              },
                                                       '2' => {
                                                                'key' => '_KeyOfValue',
                                                                'type' => '2905327'
                                                              },
                                                       '3' => {
                                                                'key' => '_Compare',
                                                                'type' => '2933125'
                                                              },
                                                       '4' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2875312'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2889657' => {
                                         'Base' => {
                                                     '2889199' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '2889484' => {
                                                                    'pos' => '1'
                                                                  },
                                                     '53803' => {
                                                                  'pos' => '2'
                                                                }
                                                   },
                                         'Header' => undef,
                                         'Line' => '660',
                                         'Name' => 'struct std::_Rb_tree<YAML::detail::node*, YAML::detail::node*, std::_Identity<YAML::detail::node*>, YAML::detail::node::less, std::allocator<YAML::detail::node*> >::_Rb_tree_impl<YAML::detail::node::less>',
                                         'NameSpace' => 'std::_Rb_tree<YAML::detail::node*, YAML::detail::node*, std::_Identity<YAML::detail::node*>, YAML::detail::node::less, std::allocator<YAML::detail::node*> >',
                                         'PrivateABI' => 1,
                                         'Protected' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key_compare',
                                                                'type' => '2933125'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2894586' => {
                                         'Header' => undef,
                                         'Line' => '94',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_t',
                                                              'offset' => '0',
                                                              'type' => '2894599'
                                                            }
                                                   },
                                         'Name' => 'std::set<YAML::detail::node*, YAML::detail::node::less>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Key',
                                                                'type' => '2939153'
                                                              },
                                                       '1' => {
                                                                'key' => '_Compare',
                                                                'type' => '2933125'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2894599' => {
                                         'BaseType' => '2889644',
                                         'Header' => undef,
                                         'Line' => '132',
                                         'Name' => 'std::set<YAML::detail::node*, YAML::detail::node::less>::_Rep_type',
                                         'NameSpace' => 'std::set<YAML::detail::node*, YAML::detail::node::less>',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2904515' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '971',
                                         'Name' => 'std::__shared_ptr_access<YAML::detail::node, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2933112'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2904662' => {
                                         'Header' => undef,
                                         'Line' => '1987',
                                         'Name' => 'struct std::remove_extent<YAML::detail::node>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2933112'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2904676' => {
                                         'BaseType' => '2933112',
                                         'Header' => undef,
                                         'Line' => '1988',
                                         'Name' => 'std::remove_extent<YAML::detail::node>::type',
                                         'NameSpace' => 'std::remove_extent<YAML::detail::node>',
                                         'PrivateABI' => 1,
                                         'Size' => '72',
                                         'Type' => 'Typedef'
                                       },
                          '2904699' => {
                                         'Base' => {
                                                     '2904515' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '1052',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '2941771'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '8',
                                                              'type' => '2864948'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<YAML::detail::node, 2>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2933112'
                                                              },
                                                       '1' => {
                                                                'key' => '_Lp',
                                                                'type' => '8198',
                                                                'val' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2904979' => {
                                         'BaseType' => '2904676',
                                         'Header' => undef,
                                         'Line' => '1056',
                                         'Name' => 'std::__shared_ptr<YAML::detail::node, 2>::element_type',
                                         'NameSpace' => 'std::__shared_ptr<YAML::detail::node, 2>',
                                         'PrivateABI' => 1,
                                         'Size' => '72',
                                         'Type' => 'Typedef'
                                       },
                          '2905295' => {
                                         'Header' => undef,
                                         'Line' => '117',
                                         'Name' => 'struct std::unary_function<YAML::detail::node*, YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Arg',
                                                                'type' => '2939153'
                                                              },
                                                       '1' => {
                                                                'key' => '_Result',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2905327' => {
                                         'Base' => {
                                                     '2905295' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '1150',
                                         'Name' => 'struct std::_Identity<YAML::detail::node*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2910523' => {
                                         'Base' => {
                                                     '4779728' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '1150',
                                         'Name' => 'struct std::_Identity<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2916299' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2916923' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<std::_Rb_tree_node<std::shared_ptr<YAML::detail::node> > >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2868060'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2917318' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<YAML::detail::node*>',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2917713' => {
                                         'Base' => {
                                                     '2875459' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '48',
                                         'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<YAML::detail::node*> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2875312'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2917914' => {
                                         'BaseType' => '2875473',
                                         'Header' => undef,
                                         'Line' => '57',
                                         'Name' => '__gnu_cxx::__alloc_traits<std::allocator<YAML::detail::node*> >::pointer',
                                         'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<YAML::detail::node*> >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '2919172' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<std::pair<YAML::detail::node*, YAML::detail::node*> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2919567' => {
                                         'Base' => {
                                                     '2880498' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '48',
                                         'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Alloc',
                                                                'type' => '2880351'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2919768' => {
                                         'BaseType' => '2880512',
                                         'Header' => undef,
                                         'Line' => '57',
                                         'Name' => '__gnu_cxx::__alloc_traits<std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >::pointer',
                                         'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '2921026' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<std::_List_node<std::pair<YAML::detail::node*, YAML::detail::node*> > >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2885911'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2921627' => {
                                         'Header' => undef,
                                         'Line' => '55',
                                         'Name' => '__gnu_cxx::new_allocator<std::_Rb_tree_node<YAML::detail::node*> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2889378'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '2923238' => {
                                         'Header' => undef,
                                         'Line' => '47',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '0',
                                                              'type' => '1120133'
                                                            }
                                                   },
                                         'Name' => 'struct __gnu_cxx::__aligned_membuf<YAML::detail::node*>',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2939153'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2923481' => {
                                         'Header' => undef,
                                         'Line' => '47',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '0',
                                                              'type' => '1007306'
                                                            }
                                                   },
                                         'Name' => 'struct __gnu_cxx::__aligned_membuf<std::shared_ptr<YAML::detail::node> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2867257'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2924093' => {
                                         'Header' => undef,
                                         'Line' => '47',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_storage',
                                                              'offset' => '0',
                                                              'type' => '1007306'
                                                            }
                                                   },
                                         'Name' => 'struct __gnu_cxx::__aligned_membuf<std::pair<YAML::detail::node*, YAML::detail::node*> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '2880015'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '2929985' => {
                                         'Header' => undef,
                                         'Line' => '11',
                                         'Name' => 'struct YAML::EmitterStyle',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'Type' => 'Struct'
                                       },
                          '2929998' => {
                                         'Header' => undef,
                                         'Line' => '12',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'Default',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'Block',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'Flow',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum YAML::EmitterStyle::value',
                                         'NameSpace' => 'YAML::EmitterStyle',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '2930030' => {
                                         'Header' => undef,
                                         'Line' => '13',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pos',
                                                              'offset' => '0',
                                                              'type' => '8012'
                                                            },
                                                     '1' => {
                                                              'name' => 'line',
                                                              'offset' => '4',
                                                              'type' => '8012'
                                                            },
                                                     '2' => {
                                                              'name' => 'column',
                                                              'offset' => '8',
                                                              'type' => '8012'
                                                            }
                                                   },
                                         'Name' => 'struct YAML::Mark',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '12',
                                         'Type' => 'Struct'
                                       },
                          '2930765' => {
                                         'Header' => undef,
                                         'Line' => '11',
                                         'Name' => 'struct YAML::NodeType',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'Type' => 'Struct'
                                       },
                          '2930778' => {
                                         'Header' => undef,
                                         'Line' => '12',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'Undefined',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'Null',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'Scalar',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'Sequence',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'Map',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum YAML::NodeType::value',
                                         'NameSpace' => 'YAML::NodeType',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '2930823' => {
                                         'Header' => undef,
                                         'Line' => '29',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_isValid',
                                                              'offset' => '0',
                                                              'type' => '7936'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'm_invalidKey',
                                                              'offset' => '8',
                                                              'type' => '50358'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pMemory',
                                                              'offset' => '64',
                                                              'type' => '2934285'
                                                            },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pNode',
                                                              'offset' => '86',
                                                              'type' => '2939153'
                                                            }
                                                   },
                                         'Name' => 'YAML::Node',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '64',
                                         'Type' => 'Class'
                                       },
                          '2932209' => {
                                         'BaseType' => '2930823',
                                         'Name' => 'YAML::Node const',
                                         'Size' => '64',
                                         'Type' => 'Const'
                                       },
                          '2932226' => {
                                         'Header' => undef,
                                         'Line' => '34',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pMemory',
                                                              'offset' => '0',
                                                              'type' => '2934436'
                                                            }
                                                   },
                                         'Name' => 'YAML::detail::memory_holder',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Class'
                                       },
                          '2933112' => {
                                         'Header' => undef,
                                         'Line' => '20',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pRef',
                                                              'offset' => '0',
                                                              'type' => '2937903'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'm_dependencies',
                                                              'offset' => '22',
                                                              'type' => '2934241'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'm_index',
                                                              'offset' => '100',
                                                              'type' => '9622'
                                                            }
                                                   },
                                         'Name' => 'YAML::detail::node',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '72',
                                         'Type' => 'Class'
                                       },
                          '2933125' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '22',
                                         'Name' => 'struct YAML::detail::node::less',
                                         'NameSpace' => 'YAML::detail::node',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'Type' => 'Struct'
                                       },
                          '2934241' => {
                                         'BaseType' => '2894586',
                                         'Header' => undef,
                                         'Line' => '169',
                                         'Name' => 'YAML::detail::node::nodes',
                                         'NameSpace' => 'YAML::detail::node',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2934285' => {
                                         'BaseType' => '2866950',
                                         'Header' => undef,
                                         'Line' => '24',
                                         'Name' => 'YAML::detail::shared_memory_holder',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2934302' => {
                                         'Header' => undef,
                                         'Line' => '23',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_nodes',
                                                              'offset' => '0',
                                                              'type' => '2934405'
                                                            }
                                                   },
                                         'Name' => 'YAML::detail::memory',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Class'
                                       },
                          '2934405' => {
                                         'BaseType' => '2872285',
                                         'Header' => undef,
                                         'Line' => '30',
                                         'Name' => 'YAML::detail::memory::Nodes',
                                         'NameSpace' => 'YAML::detail::memory',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2934436' => {
                                         'BaseType' => '2875034',
                                         'Header' => undef,
                                         'Line' => '25',
                                         'Name' => 'YAML::detail::shared_memory',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2935243' => {
                                         'Header' => undef,
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_isDefined',
                                                              'offset' => '0',
                                                              'type' => '7936'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'm_mark',
                                                              'offset' => '4',
                                                              'type' => '2930030'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'm_type',
                                                              'offset' => '22',
                                                              'type' => '2930778'
                                                            },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'm_tag',
                                                              'offset' => '36',
                                                              'type' => '50358'
                                                            },
                                                     '4' => {
                                                              'access' => 'private',
                                                              'name' => 'm_style',
                                                              'offset' => '86',
                                                              'type' => '2929998'
                                                            },
                                                     '5' => {
                                                              'access' => 'private',
                                                              'name' => 'm_scalar',
                                                              'offset' => '100',
                                                              'type' => '50358'
                                                            },
                                                     '6' => {
                                                              'access' => 'private',
                                                              'name' => 'm_sequence',
                                                              'offset' => '150',
                                                              'type' => '2936398'
                                                            },
                                                     '7' => {
                                                              'access' => 'private',
                                                              'name' => 'm_seqSize',
                                                              'offset' => '288',
                                                              'type' => '287'
                                                            },
                                                     '8' => {
                                                              'access' => 'private',
                                                              'name' => 'm_map',
                                                              'offset' => '296',
                                                              'type' => '2936436'
                                                            },
                                                     '9' => {
                                                              'access' => 'private',
                                                              'name' => 'm_undefinedPairs',
                                                              'offset' => '338',
                                                              'type' => '2936461'
                                                            }
                                                   },
                                         'Name' => 'YAML::detail::node_data',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '176',
                                         'Type' => 'Class'
                                       },
                          '2936398' => {
                                         'BaseType' => '2876671',
                                         'Header' => undef,
                                         'Line' => '111',
                                         'Name' => 'YAML::detail::node_data::node_seq',
                                         'NameSpace' => 'YAML::detail::node_data',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '2936436' => {
                                         'BaseType' => '2881710',
                                         'Header' => undef,
                                         'Line' => '117',
                                         'Name' => 'YAML::detail::node_data::node_map',
                                         'NameSpace' => 'YAML::detail::node_data',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '2936461' => {
                                         'BaseType' => '2847593',
                                         'Header' => undef,
                                         'Line' => '121',
                                         'Name' => 'YAML::detail::node_data::kv_pairs',
                                         'NameSpace' => 'YAML::detail::node_data',
                                         'Private' => 1,
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '2936933' => {
                                         'Header' => undef,
                                         'Line' => '17',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pData',
                                                              'offset' => '0',
                                                              'type' => '2937843'
                                                            }
                                                   },
                                         'Name' => 'YAML::detail::node_ref',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Class'
                                       },
                          '2937843' => {
                                         'BaseType' => '2887773',
                                         'Header' => undef,
                                         'Line' => '23',
                                         'Name' => 'YAML::detail::shared_node_data',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2937903' => {
                                         'BaseType' => '2888921',
                                         'Header' => undef,
                                         'Line' => '22',
                                         'Name' => 'YAML::detail::shared_node_ref',
                                         'NameSpace' => 'YAML::detail',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '2938623' => {
                                         'BaseType' => '2851858',
                                         'Name' => 'struct std::__detail::_List_node_base*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2939033' => {
                                         'BaseType' => '2865853',
                                         'Name' => 'std::_Sp_counted_base<2>*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2939068' => {
                                         'BaseType' => '2866644',
                                         'Name' => 'std::__shared_ptr<YAML::detail::memory_holder, 2>::element_type*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2939128' => {
                                         'BaseType' => '2932209',
                                         'Name' => 'YAML::Node const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '2939153' => {
                                         'BaseType' => '2933112',
                                         'Name' => 'YAML::detail::node*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2939468' => {
                                         'BaseType' => '2874728',
                                         'Name' => 'std::__shared_ptr<YAML::detail::memory, 2>::element_type*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2939528' => {
                                         'BaseType' => '2939153',
                                         'Name' => 'YAML::detail::node**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2939723' => {
                                         'BaseType' => '2880015',
                                         'Name' => 'struct std::pair<YAML::detail::node*, YAML::detail::node*>*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2940313' => {
                                         'BaseType' => '2887467',
                                         'Name' => 'std::__shared_ptr<YAML::detail::node_data, 2>::element_type*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2940498' => {
                                         'BaseType' => '2888615',
                                         'Name' => 'std::__shared_ptr<YAML::detail::node_ref, 2>::element_type*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2941771' => {
                                         'BaseType' => '2904979',
                                         'Name' => 'std::__shared_ptr<YAML::detail::node, 2>::element_type*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3372907' => {
                                         'Header' => undef,
                                         'Line' => '41',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_path',
                                                              'offset' => '0',
                                                              'type' => '50358'
                                                            }
                                                   },
                                         'Name' => 'ts::file::path',
                                         'NameSpace' => 'ts::file',
                                         'PrivateABI' => 1,
                                         'Size' => '32',
                                         'Type' => 'Class'
                                       },
                          '3373590' => {
                                         'BaseType' => '3372907',
                                         'Name' => 'ts::file::path const',
                                         'Size' => '32',
                                         'Type' => 'Const'
                                       },
                          '3373595' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '118',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_stat',
                                                              'offset' => '0',
                                                              'type' => '1127111'
                                                            }
                                                   },
                                         'Name' => 'ts::file::file_status',
                                         'NameSpace' => 'ts::file',
                                         'PrivateABI' => 1,
                                         'Size' => '144',
                                         'Type' => 'Class'
                                       },
                          '3373620' => {
                                         'BaseType' => '3373595',
                                         'Name' => 'ts::file::file_status const',
                                         'Size' => '144',
                                         'Type' => 'Const'
                                       },
                          '3381598' => {
                                         'BaseType' => '3373590',
                                         'Name' => 'ts::file::path const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '3381603' => {
                                         'BaseType' => '797216',
                                         'Name' => 'std::error_code&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '3384328' => {
                                         'BaseType' => '3373620',
                                         'Name' => 'ts::file::file_status const&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '3755490' => {
                                         'Header' => undef,
                                         'Line' => '84',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '3755688'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Vector_base<char, std::allocator<char> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '9260'
                                                              },
                                                       '1' => {
                                                                'key' => '_Alloc',
                                                                'type' => '38705'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3755503' => {
                                         'Header' => undef,
                                         'Line' => '91',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_start',
                                                              'offset' => '0',
                                                              'type' => '3755676'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_finish',
                                                              'offset' => '8',
                                                              'type' => '3755676'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_end_of_storage',
                                                              'offset' => '22',
                                                              'type' => '3755676'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Vector_base<char, std::allocator<char> >::_Vector_impl_data',
                                         'NameSpace' => 'std::_Vector_base<char, std::allocator<char> >',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '3755676' => {
                                         'BaseType' => '121530',
                                         'Header' => undef,
                                         'Line' => '89',
                                         'Name' => 'std::_Vector_base<char, std::allocator<char> >::pointer',
                                         'NameSpace' => 'std::_Vector_base<char, std::allocator<char> >',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '3755688' => {
                                         'Base' => {
                                                     '3755503' => {
                                                                    'pos' => '1'
                                                                  },
                                                     '38705' => {
                                                                  'pos' => '0'
                                                                }
                                                   },
                                         'Header' => undef,
                                         'Line' => '128',
                                         'Name' => 'struct std::_Vector_base<char, std::allocator<char> >::_Vector_impl',
                                         'NameSpace' => 'std::_Vector_base<char, std::allocator<char> >',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '3756435' => {
                                         'Base' => {
                                                     '3755490' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '389',
                                         'Name' => 'std::vector<char>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '9260'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '3759541' => {
                                         'Header' => undef,
                                         'Line' => '63',
                                         'Name' => 'struct std::default_delete<YAML::EmitterState>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '3781115'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3759626' => {
                                         'Header' => undef,
                                         'Line' => '128',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_t',
                                                              'offset' => '0',
                                                              'type' => '3761294'
                                                            }
                                                   },
                                         'Name' => 'std::__uniq_ptr_impl<YAML::EmitterState, std::default_delete<YAML::EmitterState> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '3781115'
                                                              },
                                                       '1' => {
                                                                'key' => '_Dp',
                                                                'type' => '3759541'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '3760078' => {
                                         'Header' => undef,
                                         'Line' => '78',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '3759541'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<1ul, std::default_delete<YAML::EmitterState> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Idx',
                                                                'type' => '7958',
                                                                'val' => '1'
                                                              },
                                                       '1' => {
                                                                'key' => '_Head',
                                                                'type' => '3759541'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3760336' => {
                                         'Base' => {
                                                     '3760078' => {
                                                                    'access' => 'private',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '416',
                                         'Name' => 'struct std::_Tuple_impl<1ul, std::default_delete<YAML::EmitterState> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Idx',
                                                                'type' => '7958',
                                                                'val' => '1'
                                                              },
                                                       '1' => {
                                                                'key' => undef,
                                                                'type' => '3759541'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3760628' => {
                                         'Header' => undef,
                                         'Line' => '187',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '3785450'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<0ul, YAML::EmitterState*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Idx',
                                                                'type' => '7958',
                                                                'val' => '0'
                                                              },
                                                       '1' => {
                                                                'key' => '_Head',
                                                                'type' => '3785450'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3760886' => {
                                         'Base' => {
                                                     '3760336' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '3760628' => {
                                                                    'access' => 'private',
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '258',
                                         'Name' => 'struct std::_Tuple_impl<0ul, YAML::EmitterState*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Idx',
                                                                'type' => '7958',
                                                                'val' => '0'
                                                              },
                                                       '1' => {
                                                                'key' => undef,
                                                                'type' => '3785450'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3761294' => {
                                         'Base' => {
                                                     '3760886' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '985',
                                         'Name' => 'std::tuple<YAML::EmitterState*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => undef,
                                                                'type' => '3785450'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '3761551' => {
                                         'Base' => {
                                                     '3759626' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '208',
                                         'Name' => 'struct std::__uniq_ptr_data<YAML::EmitterState, std::default_delete<YAML::EmitterState> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '3781115'
                                                              },
                                                       '1' => {
                                                                'key' => '_Dp',
                                                                'type' => '3759541'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3761692' => {
                                         'Header' => undef,
                                         'Line' => '242',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_t',
                                                              'offset' => '0',
                                                              'type' => '3761551'
                                                            }
                                                   },
                                         'Name' => 'std::unique_ptr<YAML::EmitterState, std::default_delete<YAML::EmitterState> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '3781115'
                                                              },
                                                       '1' => {
                                                                'key' => '_Dp',
                                                                'type' => '3759541'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '3779803' => {
                                         'Header' => undef,
                                         'Line' => '13',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'Auto',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'TagByKind',
                                                              'value' => '1'
                                                            },
                                                     '10' => {
                                                               'name' => 'UpperNull',
                                                               'value' => '10'
                                                             },
                                                     '11' => {
                                                               'name' => 'CamelNull',
                                                               'value' => '11'
                                                             },
                                                     '12' => {
                                                               'name' => 'TildeNull',
                                                               'value' => '12'
                                                             },
                                                     '13' => {
                                                               'name' => 'YesNoBool',
                                                               'value' => '13'
                                                             },
                                                     '14' => {
                                                               'name' => 'TrueFalseBool',
                                                               'value' => '14'
                                                             },
                                                     '15' => {
                                                               'name' => 'OnOffBool',
                                                               'value' => '15'
                                                             },
                                                     '16' => {
                                                               'name' => 'UpperCase',
                                                               'value' => '16'
                                                             },
                                                     '17' => {
                                                               'name' => 'LowerCase',
                                                               'value' => '17'
                                                             },
                                                     '18' => {
                                                               'name' => 'CamelCase',
                                                               'value' => '18'
                                                             },
                                                     '19' => {
                                                               'name' => 'LongBool',
                                                               'value' => '19'
                                                             },
                                                     '2' => {
                                                              'name' => 'Newline',
                                                              'value' => '2'
                                                            },
                                                     '20' => {
                                                               'name' => 'ShortBool',
                                                               'value' => '20'
                                                             },
                                                     '21' => {
                                                               'name' => 'Dec',
                                                               'value' => '21'
                                                             },
                                                     '22' => {
                                                               'name' => 'Hex',
                                                               'value' => '22'
                                                             },
                                                     '23' => {
                                                               'name' => 'Oct',
                                                               'value' => '23'
                                                             },
                                                     '24' => {
                                                               'name' => 'BeginDoc',
                                                               'value' => '24'
                                                             },
                                                     '25' => {
                                                               'name' => 'EndDoc',
                                                               'value' => '25'
                                                             },
                                                     '26' => {
                                                               'name' => 'BeginSeq',
                                                               'value' => '26'
                                                             },
                                                     '27' => {
                                                               'name' => 'EndSeq',
                                                               'value' => '27'
                                                             },
                                                     '28' => {
                                                               'name' => 'Flow',
                                                               'value' => '28'
                                                             },
                                                     '29' => {
                                                               'name' => 'Block',
                                                               'value' => '29'
                                                             },
                                                     '3' => {
                                                              'name' => 'EmitNonAscii',
                                                              'value' => '3'
                                                            },
                                                     '30' => {
                                                               'name' => 'BeginMap',
                                                               'value' => '30'
                                                             },
                                                     '31' => {
                                                               'name' => 'EndMap',
                                                               'value' => '31'
                                                             },
                                                     '32' => {
                                                               'name' => 'Key',
                                                               'value' => '32'
                                                             },
                                                     '33' => {
                                                               'name' => 'Value',
                                                               'value' => '33'
                                                             },
                                                     '34' => {
                                                               'name' => 'LongKey',
                                                               'value' => '34'
                                                             },
                                                     '4' => {
                                                              'name' => 'EscapeNonAscii',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'EscapeAsJson',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'SingleQuoted',
                                                              'value' => '6'
                                                            },
                                                     '7' => {
                                                              'name' => 'DoubleQuoted',
                                                              'value' => '7'
                                                            },
                                                     '8' => {
                                                              'name' => 'Literal',
                                                              'value' => '8'
                                                            },
                                                     '9' => {
                                                              'name' => 'LowerNull',
                                                              'value' => '9'
                                                            }
                                                   },
                                         'Name' => 'enum YAML::EMITTER_MANIP',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '3780520' => {
                                         'Header' => undef,
                                         'Line' => '16',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_buffer',
                                                              'offset' => '0',
                                                              'type' => '3756435'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pStream',
                                                              'offset' => '36',
                                                              'type' => '3785435'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pos',
                                                              'offset' => '50',
                                                              'type' => '287'
                                                            },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'm_row',
                                                              'offset' => '64',
                                                              'type' => '287'
                                                            },
                                                     '4' => {
                                                              'access' => 'private',
                                                              'name' => 'm_col',
                                                              'offset' => '72',
                                                              'type' => '287'
                                                            },
                                                     '5' => {
                                                              'access' => 'private',
                                                              'name' => 'm_comment',
                                                              'offset' => '86',
                                                              'type' => '7936'
                                                            }
                                                   },
                                         'Name' => 'YAML::ostream_wrapper',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '64',
                                         'Type' => 'Class'
                                       },
                          '3781115' => {
                                         'Copied' => 1,
                                         'Header' => undef,
                                         'Line' => '31',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_isGood',
                                                              'offset' => '0',
                                                              'type' => '7936'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'm_lastError',
                                                              'offset' => '8',
                                                              'type' => '50358'
                                                            },
                                                     '10' => {
                                                               'access' => 'private',
                                                               'name' => 'm_preCommentIndent',
                                                               'offset' => '128',
                                                               'type' => '3952452'
                                                             },
                                                     '11' => {
                                                               'access' => 'private',
                                                               'name' => 'm_postCommentIndent',
                                                               'offset' => '136',
                                                               'type' => '3952452'
                                                             },
                                                     '12' => {
                                                               'access' => 'private',
                                                               'name' => 'm_seqFmt',
                                                               'offset' => '150',
                                                               'type' => '3952260'
                                                             },
                                                     '13' => {
                                                               'access' => 'private',
                                                               'name' => 'm_mapFmt',
                                                               'offset' => '256',
                                                               'type' => '3952260'
                                                             },
                                                     '14' => {
                                                               'access' => 'private',
                                                               'name' => 'm_mapKeyFmt',
                                                               'offset' => '260',
                                                               'type' => '3952260'
                                                             },
                                                     '15' => {
                                                               'access' => 'private',
                                                               'name' => 'm_floatPrecision',
                                                               'offset' => '274',
                                                               'type' => '3952452'
                                                             },
                                                     '16' => {
                                                               'access' => 'private',
                                                               'name' => 'm_doublePrecision',
                                                               'offset' => '288',
                                                               'type' => '3952452'
                                                             },
                                                     '17' => {
                                                               'access' => 'private',
                                                               'name' => 'm_modifiedSettings',
                                                               'offset' => '296',
                                                               'type' => '3951011'
                                                             },
                                                     '18' => {
                                                               'access' => 'private',
                                                               'name' => 'm_globalModifiedSettings',
                                                               'offset' => '338',
                                                               'type' => '3951011'
                                                             },
                                                     '19' => {
                                                               'access' => 'private',
                                                               'name' => 'm_groups',
                                                               'offset' => '374',
                                                               'type' => '3923026'
                                                             },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'm_charset',
                                                              'offset' => '64',
                                                              'type' => '3952260'
                                                            },
                                                     '20' => {
                                                               'access' => 'private',
                                                               'name' => 'm_curIndent',
                                                               'offset' => '512',
                                                               'type' => '287'
                                                             },
                                                     '21' => {
                                                               'access' => 'private',
                                                               'name' => 'm_hasAnchor',
                                                               'offset' => '520',
                                                               'type' => '7936'
                                                             },
                                                     '22' => {
                                                               'access' => 'private',
                                                               'name' => 'm_hasAlias',
                                                               'offset' => '521',
                                                               'type' => '7936'
                                                             },
                                                     '23' => {
                                                               'access' => 'private',
                                                               'name' => 'm_hasTag',
                                                               'offset' => '528',
                                                               'type' => '7936'
                                                             },
                                                     '24' => {
                                                               'access' => 'private',
                                                               'name' => 'm_hasNonContent',
                                                               'offset' => '529',
                                                               'type' => '7936'
                                                             },
                                                     '25' => {
                                                               'access' => 'private',
                                                               'name' => 'm_docCount',
                                                               'offset' => '534',
                                                               'type' => '287'
                                                             },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'm_strFmt',
                                                              'offset' => '68',
                                                              'type' => '3952260'
                                                            },
                                                     '4' => {
                                                              'access' => 'private',
                                                              'name' => 'm_boolFmt',
                                                              'offset' => '72',
                                                              'type' => '3952260'
                                                            },
                                                     '5' => {
                                                              'access' => 'private',
                                                              'name' => 'm_boolLengthFmt',
                                                              'offset' => '82',
                                                              'type' => '3952260'
                                                            },
                                                     '6' => {
                                                              'access' => 'private',
                                                              'name' => 'm_boolCaseFmt',
                                                              'offset' => '86',
                                                              'type' => '3952260'
                                                            },
                                                     '7' => {
                                                              'access' => 'private',
                                                              'name' => 'm_nullFmt',
                                                              'offset' => '96',
                                                              'type' => '3952260'
                                                            },
                                                     '8' => {
                                                              'access' => 'private',
                                                              'name' => 'm_intFmt',
                                                              'offset' => '100',
                                                              'type' => '3952260'
                                                            },
                                                     '9' => {
                                                              'access' => 'private',
                                                              'name' => 'm_indent',
                                                              'offset' => '114',
                                                              'type' => '3952452'
                                                            }
                                                   },
                                         'Name' => 'YAML::EmitterState',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '224',
                                         'Type' => 'Class'
                                       },
                          '3781120' => {
                                         'Header' => undef,
                                         'Line' => '33',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'm_pState',
                                                              'offset' => '0',
                                                              'type' => '3761692'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'm_stream',
                                                              'offset' => '8',
                                                              'type' => '3780520'
                                                            }
                                                   },
                                         'Name' => 'YAML::Emitter',
                                         'NameSpace' => 'YAML',
                                         'PrivateABI' => 1,
                                         'Size' => '72',
                                         'Type' => 'Class'
                                       },
                          '3785430' => {
                                         'BaseType' => '53523',
                                         'Name' => 'std::ostream*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3785435' => {
                                         'BaseType' => '3785430',
                                         'Name' => 'std::ostream*const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '3785450' => {
                                         'BaseType' => '3781115',
                                         'Name' => 'YAML::EmitterState*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3785685' => {
                                         'BaseType' => '3781120',
                                         'Name' => 'YAML::Emitter&',
                                         'Size' => '8',
                                         'Type' => 'Ref'
                                       },
                          '38705' => {
                                       'Base' => {
                                                   '120856' => {
                                                                 'pos' => '0'
                                                               }
                                                 },
                                       'Header' => undef,
                                       'Line' => '124',
                                       'Name' => 'std::allocator<char>',
                                       'NameSpace' => 'std',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'TParam' => {
                                                     '0' => {
                                                              'name' => 'char'
                                                            }
                                                   },
                                       'Type' => 'Class'
                                     },
                          '38851' => {
                                       'Header' => undef,
                                       'Line' => '98',
                                       'Memb' => {
                                                   '0' => {
                                                            'access' => 'private',
                                                            'name' => '_M_len',
                                                            'offset' => '0',
                                                            'type' => '287'
                                                          },
                                                   '1' => {
                                                            'access' => 'private',
                                                            'name' => '_M_str',
                                                            'offset' => '8',
                                                            'type' => '9825'
                                                          }
                                                 },
                                       'Name' => 'std::basic_string_view<char>',
                                       'NameSpace' => 'std',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'TParam' => {
                                                     '0' => {
                                                              'key' => '_CharT',
                                                              'type' => '9260'
                                                            }
                                                   },
                                       'Type' => 'Class'
                                     },
                          '3914279' => {
                                         'Header' => undef,
                                         'Line' => '63',
                                         'Name' => 'struct std::default_delete<YAML::SettingChangeBase>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '3950870'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3914364' => {
                                         'Header' => undef,
                                         'Line' => '128',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_t',
                                                              'offset' => '0',
                                                              'type' => '3916018'
                                                            }
                                                   },
                                         'Name' => 'std::__uniq_ptr_impl<YAML::SettingChangeBase, std::default_delete<YAML::SettingChangeBase> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Tp',
                                                                'type' => '3950870'
                                                              },
                                                       '1' => {
                                                                'key' => '_Dp',
                                                                'type' => '3914279'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '3914812' => {
                                         'Header' => undef,
                                         'Line' => '78',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '3914279'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<1ul, std::default_delete<YAML::SettingChangeBase> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Idx',
                                                                'type' => '7958',
                                                                'val' => '1'
                                                              },
                                                       '1' => {
                                                                'key' => '_Head',
                                                                'type' => '3914279'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3915070' => {
                                         'Base' => {
                                                     '3914812' => {
                                                                    'access' => 'private',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Header' => undef,
                                         'Line' => '416',
                                         'Name' => 'struct std::_Tuple_impl<1ul, std::default_delete<YAML::SettingChangeBase> >',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'key' => '_Idx',
                                                                'type' => '7958',
                                                                'val' => '1'
                                                              },
                                                       '1' => {
                                                                'key' => undef,
                                                                'type' => '3914279'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '3915358' => {
                                         'Header' => undef,
                                         'Line' => '187',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '3950848'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<0ul, YAML::SettingChangeBase*>',
                                         'NameSpace' => 'std',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'TParam' => {
